src/test/resources/apiXml/JLR/NSC/GetJobDetailsByOlbSingleUAT.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:men="http://www.cliffordthames.com/ebusiness/menus/">
   <soapenv:Header/>
   <soapenv:Body>
      <men:getJobDetailsByOlb>
         <men:jobDetailsByOlbRequest>
            <men:dealerDetails countryCode="GB" dealerIdentificationCode="GBdummy03" languageCode="EN" manufacturer="JLR" user=""/>
            <men:olbProviderDetails id="107" password="Hammer666"/>
            <!--1 to 25 repetitions:-->
            <men:job core="true" id="101001705085" jobSource="MAN" service="true"/>
            <men:vehicleMatch>
               <!--Optional:-->
               <men:vinMatch>SALGA2EE0DA105481</men:vinMatch>
            </men:vehicleMatch>men:vehicleMatch&gt;
         </men:jobDetailsByOlbRequest>
      </men:getJobDetailsByOlb>
   </soapenv:Body>
</soapenv:Envelope>